# BtuPerHFtDegreeF Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SymbolTypeId..::..BtuPerHFtDegreeF Property
SymbolTypeId Class See Also
---
Symbol BTU/(h·ft·°F), indicating unit British thermal units per hour foot degree Fahrenheit.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId BtuPerHFtDegreeF { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property BtuPerHFtDegreeF As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ BtuPerHFtDegreeF {
	ForgeTypeId^ get ();
}
```

# See Also
SymbolTypeId Class
Autodesk.Revit.DB Namespace